Tekla Open API Reference for Tekla Structures 2025
Matrix Constructor
 Creates a new indentity matrix.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Matrix()
Public Sub New
See Also
Reference
Matrix Class
Matrix Overload
Tekla.Structures.Geometry3d Namespace